-- Пользователи
INSERT INTO User_Theatre (first_name, last_name, email, passport_data, password_hash) VALUES
    ('Карина',    'Нестеренко',  'karnesterenko@bk.ru',   '1234 567890', 'password1'),
    ('Александр', 'Расин',       'rasin.aa@mail.ru',      '2345 678901', 'password2'),
    ('Евгений',   'Пальчевский', 'palchevsky.ev@gmail.com','3456 789012', 'password3');

-- Спектакли
INSERT INTO Performance (title, description, performance_date, duration, base_price) VALUES
    ('Король Убю',
    'Автор: Альфред Жарри. Жанр: Комедия-фарс. Возраст: 18+. Власть, доставшаяся случайно, власть извращающая, власть разрушающая — вот тема этого по сути трагического спектакля, сделанного в форме весёлой буффонады.',
    '2026-12-15 15:30:00', 145, 2000.00),

    ('Гамлет',
    'Автор: Уильям Шекспир. Жанр: Трагедия. Возраст: 16+. История принца датского, который решает отомстить за смерть отца и погружается в пучину сомнений и безумия.',
    '2026-11-20 19:00:00', 180, 2500.00),

    ('Призрак Оперы',
    'Автор: Гастон Леру (адаптация). Жанр: Мюзикл-драма. Возраст: 12+. Таинственный призрак, обитающий в подвалах Парижской оперы, влюбляется в юную певицу Кристину.',
     '2026-10-10 19:00:00', 160, 3000.00),

    ('Механика любви',
    'Автор: Современная пьеса. Жанр: Романтическая комедия. Возраст: 16+. В основе — идея о том, что зачастую счастливыми нас может сделать совсем не тот человек, который «сидит у нас в голове», а кто-то, принципиально отличающийся от этого образа. ',
    '2026-12-01 18:00:00', 85, 1500.00),

    ('Евгений Онегин',
    'Автор: А. С. Пушкин (инсценировка). Жанр: Драма. Возраст: 12+. Классическая история о любви, гордости, скуке и упущенных возможностях.',
    '2025-05-15 19:00:00', 170, 2200.00);


-- Билеты
-- 1–4 paid
-- 5–7 booked
-- 8–10 canceled
INSERT INTO Ticket (user_id, performance_id, row_number, seat_number, status, created_at) VALUES
(1, 1,  7,  5, 'paid',     '2026-09-20 10:00:00'),  -- Карина,    Король Убю
(1, 4,  3, 12, 'paid',     '2026-09-20 10:05:00'),  -- Карина,    Механика любви
(2, 1,  7,  6, 'paid',     '2026-09-20 10:10:00'),  -- Александр, Король Убю
(2, 4,  3, 13, 'paid',     '2026-09-20 10:15:00'),  -- Александр, Механика любви

(1, 5,  1,  1, 'booked',   '2025-04-01 12:00:00'),  -- Карина,    Евгений Онегин
(2, 3,  5, 10, 'booked',   '2026-09-21 12:05:00'),  -- Александр, Призрак Оперы
(3, 3,  5, 11, 'booked',   '2026-09-21 12:10:00'),  -- Евгений,   Призрак Оперы

(2, 2,  4,  7, 'canceled', '2026-09-15 09:00:00'),  -- Александр, Гамлет
(2, 5,  1,  2, 'canceled', '2025-03-20 09:05:00'),  -- Александр, Евгений Онегин
(3, 4,  4, 15, 'canceled', '2026-09-15 09:10:00');  -- Евгений,   Механика любви